booker.yml
### Good reference https://www.artillery.io/docs/reference/test-script

config:
  target: "https://restful-booker.herokuapp.com"
  phases:
    - duration: 1
      name: Post to booker
      arrivalRate: 1
      # rampTo: 1

scenarios:
  # We define one scenario:
  - name: "Signin with email and password"
    flow:
      - post:
          url: "/auth"
          json:
            username: "admin"
            password: "password123"
          capture:
          - json: "$"
            as: "response"
          - json: "$.token"
            as: "token"
          expect:
            - statusCode: 200
      - log: "Got response as : {{ response }}"
      - log: "Got token as : {{ token }}"